{"class_name": "Tokenizer", "config": {"num_words": null, "filters": "", "lower": true, "split": " ", "char_level": false, "oov_token": "<UNK>", "document_count": 156254, "word_counts": "{\"stmt_expression\": 1155800, \"expr_assign\": 1075415, \"expr_variable\": 2284360, \"var1\": 459581, \"scalar_string\": 850728, \"mysql\": 23005, \"var2\": 342964, \"username\": 32318, \"var3\": 334994, \"password\": 69415, \"var4\": 311437, \"mydb\": 32321, \"var5\": 218612, \"expr_new\": 37006, \"name\": 979416, \"mysqli\": 23005, \"arg\": 1175554, \"var6\": 211313, \"expr_funccall\": 584159, \"filter_input\": 54787, \"expr_constfetch\": 358251, \"input_get\": 112878, \"t\": 208981, \"filter_sanitize_number_float\": 15609, \"stmt_if\": 56870, \"expr_binaryop_equal\": 22555, \"gettype\": 5630, \"string\": 2844, \"var7\": 134276, \"var8\": 88455, \"var9\": 64756, \"expr_binaryop_concat\": 298514, \"select\": 58698, \"*\": 60104, \"from\": 58698, \"users\": 58698, \"where\": 58698, \"pin\": 21601, \"=\": 21601, \";\": 21601, \"expr_methodcall\": 78731, \"identifier\": 78731, \"multi_query\": 4616, \"var10\": 52790, \"use_result\": 18363, \"stmt_while\": 49385, \"var11\": 46903, \"fetch_row\": 23005, \"stmt_echo\": 69560, \"htmlentities\": 64493, \"print_r\": 68014, \"true\": 69426, \"filter_input_array\": 58091, \"expr_array\": 79464, \"arrayitem\": 100379, \"filter_sanitize_full_special_chars\": 15411, \"expr_arraydimfetch\": 96103, \"bin2hex\": 1407, \"=\\\"\": 15496, \"\\\";\": 15496, \"real_query\": 4536, \"pg_pconnect\": 6197, \"host=postgres-server\": 6197, \"port=5432\": 6197, \"user=postgres\": 6197, \"password=postgres123\": 6197, \"dbname=mydb\": 6197, \"apache_request_headers\": 7245, \"sscanf\": 2797, \"foo\": 2797, \"%d\": 12304, \"implode\": 7097, \"_\": 7097, \"pg_send_query\": 3135, \"pg_get_result\": 3135, \"pg_fetch_row\": 6197, \"filter_sanitize_url\": 15523, \"filter_var\": 11375, \"filter_sanitize_add_slashes\": 15497, \"mysqli_multi_query\": 4595, \"expr_binaryop_plus\": 2841, \"scalar_int\": 16464, \"='\": 21601, \"';\": 21601, \"var12\": 16461, \"ctype_cntrl\": 1470, \"<img\": 13905, \"src=\\\"\": 13905, \"\\\"/>\": 13905, \"expr_print\": 10795, \"is_integer\": 1444, \"<script>alert(\\\"hello\": 14032, \"\\\");</script>\": 14032, \"vprintf\": 21610, \"this%s\": 10857, \"addslashes\": 1455, \"user_error\": 10782, \"filter_unsafe_raw\": 15537, \"settype\": 5723, \"float\": 1407, \"hello\": 41829, \"to\": 27835, \"\\\"\": 30839, \"trigger_error\": 10866, \"e_user_error\": 10866, \"md5\": 2897, \"false\": 19802, \"gzdeflate\": 1423, \"this%d\": 10753, \"crypt\": 1424, \"<a\": 13881, \"href=\\\"\": 13881, \"\\\">link</a>\": 13881, \"printf\": 21811, \"print\": 21811, \"this:\": 21811, \"%s\": 12304, \"integer\": 1367, \"'\": 36279, \"database\": 9316, \"uid\": 9316, \"sa\": 9316, \"pwd\": 9316, \"msql12345678!\": 9316, \"sqlsrv_connect\": 9316, \"mssql\": 9316, \"expr_exit\": 26325, \"sqlsrv_errors\": 9316, \"filter_sanitize_number_int\": 15533, \"str_getcsv\": 1414, \"sqlsrv_query\": 4674, \"sqlsrv_fetch_object\": 4674, \"database=mydb;hostname=ibm_db2;port=50000;protocol=tcpip;uid=db2inst1;pwd=ibm_db2_pw;\": 6179, \"db2_connect\": 6179, \"gzcompress\": 1400, \"db2_prepare\": 3048, \"db2_stmt_errormsg\": 6179, \"db2_execute\": 3048, \"db2_fetch_array\": 6179, \"preg_match\": 4184, \"/^[a-za-z]*$/\": 1390, \"<script>alert(hello\": 13909, \");</script>\": 13909, \"strspn\": 1423, \"needle)\": 1423, \"filter_sanitize_email\": 15511, \"ent_noquotes\": 3734, \"/^[0-9]*$/\": 1411, \"base64_encode\": 1409, \"str_word_count\": 2908, \"ctype_alpha\": 1453, \"filter_sanitize_special_chars\": 15632, \"is_int\": 1433, \"mysqli_prepare\": 4642, \"mysqli_stmt_execute\": 4642, \"mysqli_stmt_get_result\": 4642, \"substr_replace\": 2845, \"bob\": 2845, \"db2_exec\": 3131, \"hexdec\": 1430, \"double\": 1434, \"var13\": 1804, \"rawurlencode\": 1429, \"safe1\": 1412, \"safe2\": 1412, \"in_array\": 1412, \"pdo\": 9313, \"mysql:host=mysql;port=3306;dbname=mydb\": 9313, \"intval\": 1438, \"prepare\": 4718, \"execute\": 4718, \"stmt_foreach\": 9313, \"fetchall\": 4718, \"str_replace\": 5688, \"<\": 2879, \">\": 2879, \"pg_query\": 3062, \"ctype_alnum\": 1425, \"is_string\": 1473, \"mysqli_real_query\": 4616, \"htmlspecialchars\": 5646, \"ent_quotes\": 2837, \"ord\": 1414, \"sqlite3\": 4688, \"/var/www/db/database.db\": 4688, \"strrpos\": 1391, \"needle\": 5640, \"query\": 9283, \"fetcharray\": 4688, \"strpos\": 1402, \"ctype_digit\": 1455, \"strip_tags\": 1398, \"getallheaders\": 7205, \"json_encode\": 2662, \"json_pretty_print\": 887, \"metaphone\": 1419, \"expr_ternary\": 1430, \"desc\": 2860, \"asc\": 1430, \"expr_cast_double\": 1434, \"sha1\": 1448, \"hash_hmac\": 1429, \"salt\": 1429, \"is_double\": 1470, \"gzencode\": 1392, \"bool\": 1439, \"strtr\": 1445, \"ctype_xdigit\": 1409, \"sqlsrv_prepare\": 4642, \"sqlsrv_execute\": 4642, \"sqlsrv_fetch_array\": 4642, \"sqlsrv_fetch_assoc\": 4642, \"/[0-9]/\": 1383, \"''\": 1437, \"str_shuffle\": 1382, \"int\": 1432, \"is_float\": 1419, \"soundex\": 1458, \"bindec\": 1390, \"expr_cast_string\": 1419, \"ent_compat\": 3762, \"is_bool\": 1442, \"fnmatch\": 2818, \"whitelisting\": 1412, \"addcslashes\": 1426, \";:'\\\"\": 1426, \"urlencode\": 1427, \"expr_assignop_plus\": 2793, \"scalar_float\": 2862, \"doubleval\": 1402, \"zlib_encode\": 1412, \"zlib_encoding_deflate\": 1412, \"expr_cast_int\": 1400, \"hash\": 1391, \"ripemd160\": 1391, \"str_ireplace\": 2834, \"floatval\": 1401, \"boolean\": 1430, \"preg_replace\": 1445, \"/'/\": 1445, \"parse_str\": 1441, \"html_entity_decode\": 1442, \"substr_count\": 1420, \"preg_match_all\": 1434, \"/^[a-za-z0-9]*$/\": 1434, \"is_long\": 1410, \"count_chars\": 1434, \"mhash\": 1404, \"mhash_md4\": 1404, \"count\": 902, \"is_real\": 1458, \"strstr\": 1378, \"1\": 1378, \"is_numeric\": 1413, \"http_build_query\": 892, \"sizeof\": 908, \"count_normal\": 908, \"password_hash\": 1440, \"password_default\": 1440, \"crc32\": 1415, \"strripos\": 1427, \"quote\": 86, \"var14\": 14}", "word_docs": "{\"var2\": 156254, \"filter_input\": 54787, \"select\": 58698, \"input_get\": 112878, \"var9\": 33109, \"=\": 21601, \"expr_assign\": 156254, \"var10\": 24517, \"stmt_while\": 49385, \"gettype\": 5630, \"expr_methodcall\": 37006, \"name\": 155773, \"true\": 59577, \"pin\": 21601, \"print_r\": 58698, \"arg\": 155529, \"identifier\": 37006, \"stmt_echo\": 69560, \"multi_query\": 4616, \"expr_binaryop_concat\": 156254, \"from\": 58698, \"stmt_expression\": 156254, \"use_result\": 18363, \"filter_sanitize_number_float\": 15482, \"expr_new\": 37006, \"expr_binaryop_equal\": 21858, \"var6\": 86759, \"where\": 58698, \"var7\": 64064, \"expr_funccall\": 155773, \"var8\": 46263, \"fetch_row\": 23005, \"users\": 58698, \"stmt_if\": 52790, \"var1\": 156254, \"htmlentities\": 62314, \"var4\": 156254, \"var11\": 23019, \"t\": 153935, \"mysqli\": 23005, \"username\": 32318, \"expr_constfetch\": 137602, \";\": 21601, \"scalar_string\": 156254, \"*\": 59568, \"mydb\": 32321, \"string\": 2844, \"expr_variable\": 156254, \"var3\": 156254, \"mysql\": 23005, \"var5\": 100012, \"password\": 47901, \"=\\\"\": 15496, \"bin2hex\": 1407, \"arrayitem\": 66571, \"filter_sanitize_full_special_chars\": 15284, \"\\\";\": 15496, \"expr_array\": 71303, \"filter_input_array\": 58091, \"expr_arraydimfetch\": 96103, \"real_query\": 4536, \"apache_request_headers\": 7245, \"foo\": 2797, \"sscanf\": 2797, \"port=5432\": 6197, \"pg_pconnect\": 6197, \"user=postgres\": 6197, \"pg_get_result\": 3135, \"pg_send_query\": 3135, \"%d\": 12216, \"password=postgres123\": 6197, \"implode\": 7097, \"pg_fetch_row\": 6197, \"_\": 7097, \"dbname=mydb\": 6197, \"host=postgres-server\": 6197, \"mysqli_multi_query\": 4595, \"filter_sanitize_add_slashes\": 15375, \"filter_var\": 11375, \"filter_sanitize_url\": 15392, \"expr_binaryop_plus\": 2841, \"scalar_int\": 16464, \"='\": 21601, \"';\": 21601, \"var12\": 8227, \"expr_print\": 10795, \"\\\"/>\": 13905, \"<img\": 13905, \"src=\\\"\": 13905, \"ctype_cntrl\": 1470, \"this%s\": 10857, \"vprintf\": 21610, \"<script>alert(\\\"hello\": 14032, \"\\\");</script>\": 14032, \"is_integer\": 1444, \"user_error\": 10782, \"addslashes\": 1455, \"float\": 1407, \"\\\"\": 16588, \"e_user_error\": 10866, \"trigger_error\": 10866, \"filter_unsafe_raw\": 15410, \"to\": 27835, \"hello\": 41829, \"settype\": 5723, \"md5\": 2897, \"false\": 19363, \"this%d\": 10753, \"gzdeflate\": 1423, \"this:\": 21811, \"print\": 21811, \"printf\": 21811, \"%s\": 12197, \"href=\\\"\": 13881, \"\\\">link</a>\": 13881, \"<a\": 13881, \"crypt\": 1424, \"'\": 21672, \"integer\": 1367, \"filter_sanitize_number_int\": 15416, \"sqlsrv_errors\": 9316, \"sqlsrv_connect\": 9316, \"uid\": 9316, \"str_getcsv\": 1414, \"sqlsrv_fetch_object\": 4674, \"expr_exit\": 26325, \"mssql\": 9316, \"pwd\": 9316, \"sqlsrv_query\": 4674, \"sa\": 9316, \"database\": 9316, \"msql12345678!\": 9316, \"db2_stmt_errormsg\": 6179, \"db2_connect\": 6179, \"db2_execute\": 3048, \"db2_fetch_array\": 6179, \"database=mydb;hostname=ibm_db2;port=50000;protocol=tcpip;uid=db2inst1;pwd=ibm_db2_pw;\": 6179, \"gzcompress\": 1400, \"db2_prepare\": 3048, \"<script>alert(hello\": 13909, \");</script>\": 13909, \"/^[a-za-z]*$/\": 1390, \"preg_match\": 4184, \"strspn\": 1423, \"needle)\": 1423, \"filter_sanitize_email\": 15381, \"ent_noquotes\": 3734, \"/^[0-9]*$/\": 1411, \"base64_encode\": 1409, \"str_word_count\": 2908, \"ctype_alpha\": 1453, \"filter_sanitize_special_chars\": 15498, \"mysqli_stmt_get_result\": 4642, \"mysqli_prepare\": 4642, \"mysqli_stmt_execute\": 4642, \"is_int\": 1433, \"bob\": 2845, \"db2_exec\": 3131, \"substr_replace\": 2845, \"hexdec\": 1430, \"double\": 1434, \"var13\": 902, \"rawurlencode\": 1429, \"in_array\": 1412, \"safe2\": 1412, \"safe1\": 1412, \"mysql:host=mysql;port=3306;dbname=mydb\": 9313, \"stmt_foreach\": 9313, \"intval\": 1438, \"execute\": 4718, \"fetchall\": 4718, \"prepare\": 4718, \"pdo\": 9313, \">\": 2879, \"str_replace\": 5688, \"<\": 2879, \"pg_query\": 3062, \"ctype_alnum\": 1425, \"is_string\": 1473, \"mysqli_real_query\": 4616, \"ent_quotes\": 2837, \"htmlspecialchars\": 5646, \"ord\": 1414, \"sqlite3\": 4688, \"/var/www/db/database.db\": 4688, \"fetcharray\": 4688, \"query\": 9283, \"strrpos\": 1391, \"needle\": 5640, \"strpos\": 1402, \"ctype_digit\": 1455, \"strip_tags\": 1398, \"getallheaders\": 7205, \"json_encode\": 2662, \"json_pretty_print\": 887, \"metaphone\": 1419, \"asc\": 1430, \"expr_ternary\": 1430, \"desc\": 1430, \"expr_cast_double\": 1434, \"sha1\": 1448, \"salt\": 1429, \"hash_hmac\": 1429, \"is_double\": 1470, \"gzencode\": 1392, \"bool\": 1439, \"strtr\": 1445, \"sqlsrv_fetch_array\": 4642, \"sqlsrv_execute\": 4642, \"sqlsrv_prepare\": 4642, \"ctype_xdigit\": 1409, \"sqlsrv_fetch_assoc\": 4642, \"/[0-9]/\": 1383, \"''\": 1437, \"str_shuffle\": 1382, \"int\": 1432, \"is_float\": 1419, \"soundex\": 1458, \"bindec\": 1390, \"expr_cast_string\": 1419, \"ent_compat\": 3762, \"is_bool\": 1442, \"whitelisting\": 1412, \"fnmatch\": 2818, \"addcslashes\": 1426, \";:'\\\"\": 1426, \"urlencode\": 1427, \"scalar_float\": 2862, \"expr_assignop_plus\": 2793, \"doubleval\": 1402, \"zlib_encode\": 1412, \"zlib_encoding_deflate\": 1412, \"expr_cast_int\": 1400, \"hash\": 1391, \"ripemd160\": 1391, \"str_ireplace\": 2834, \"floatval\": 1401, \"boolean\": 1430, \"/'/\": 1445, \"preg_replace\": 1445, \"parse_str\": 1441, \"html_entity_decode\": 1442, \"substr_count\": 1420, \"/^[a-za-z0-9]*$/\": 1434, \"preg_match_all\": 1434, \"is_long\": 1410, \"count_chars\": 1434, \"mhash_md4\": 1404, \"mhash\": 1404, \"count\": 902, \"is_real\": 1458, \"strstr\": 1378, \"1\": 1378, \"is_numeric\": 1413, \"http_build_query\": 892, \"count_normal\": 908, \"sizeof\": 908, \"password_hash\": 1440, \"password_default\": 1440, \"crc32\": 1415, \"strripos\": 1427, \"quote\": 86, \"var14\": 7}", "index_docs": "{\"11\": 156254, \"39\": 54787, \"33\": 58698, \"19\": 112878, \"30\": 33109, \"60\": 21601, \"5\": 156254, \"40\": 24517, \"41\": 49385, \"128\": 5630, \"24\": 37006, \"6\": 155773, \"27\": 59577, \"59\": 21601, \"29\": 58698, \"3\": 155529, \"25\": 37006, \"26\": 69560, \"144\": 4616, \"14\": 156254, \"34\": 58698, \"4\": 156254, \"65\": 18363, \"69\": 15482, \"44\": 37006, \"54\": 21858, \"16\": 86759, \"36\": 58698, \"18\": 64064, \"8\": 155773, \"22\": 46263, \"53\": 23005, \"35\": 58698, \"38\": 52790, \"9\": 156254, \"31\": 62314, \"13\": 156254, \"42\": 23019, \"17\": 153935, \"52\": 23005, \"47\": 32318, \"10\": 137602, \"61\": 21601, \"7\": 156254, \"32\": 59568, \"46\": 32321, \"165\": 2844, \"2\": 156254, \"12\": 156254, \"51\": 23005, \"15\": 100012, \"28\": 47901, \"75\": 15496, \"237\": 1407, \"20\": 66571, \"77\": 15284, \"76\": 15496, \"23\": 71303, \"37\": 58091, \"21\": 96103, \"147\": 4536, \"109\": 7245, \"171\": 2797, \"170\": 2797, \"115\": 6197, \"113\": 6197, \"116\": 6197, \"152\": 3135, \"151\": 3135, \"88\": 12216, \"117\": 6197, \"111\": 7097, \"119\": 6197, \"112\": 7097, \"118\": 6197, \"114\": 6197, \"146\": 4595, \"74\": 15375, \"90\": 11375, \"72\": 15392, \"166\": 2841, \"66\": 16464, \"62\": 21601, \"63\": 21601, \"67\": 8227, \"94\": 10795, \"84\": 13905, \"82\": 13905, \"83\": 13905, \"176\": 1470, \"93\": 10857, \"58\": 21610, \"78\": 14032, \"79\": 14032, \"187\": 1444, \"95\": 10782, \"180\": 1455, \"238\": 1407, \"48\": 16588, \"92\": 10866, \"91\": 10866, \"70\": 15410, \"49\": 27835, \"43\": 41829, \"124\": 5723, \"158\": 2897, \"64\": 19363, \"96\": 10753, \"216\": 1423, \"57\": 21811, \"56\": 21811, \"55\": 21811, \"89\": 12197, \"86\": 13881, \"87\": 13881, \"85\": 13881, \"215\": 1424, \"45\": 21672, \"257\": 1367, \"71\": 15416, \"104\": 9316, \"102\": 9316, \"98\": 9316, \"224\": 1414, \"136\": 4674, \"50\": 26325, \"103\": 9316, \"100\": 9316, \"135\": 4674, \"99\": 9316, \"97\": 9316, \"101\": 9316, \"122\": 6179, \"121\": 6179, \"156\": 3048, \"123\": 6179, \"120\": 6179, \"244\": 1400, \"155\": 3048, \"80\": 13909, \"81\": 13909, \"251\": 1390, \"148\": 4184, \"217\": 1423, \"218\": 1423, \"73\": 15381, \"150\": 3734, \"233\": 1411, \"235\": 1409, \"157\": 2908, \"182\": 1453, \"68\": 15498, \"139\": 4642, \"137\": 4642, \"138\": 4642, \"201\": 1433, \"164\": 2845, \"153\": 3131, \"163\": 2845, \"203\": 1430, \"196\": 1434, \"174\": 902, \"207\": 1429, \"229\": 1412, \"228\": 1412, \"227\": 1412, \"106\": 9313, \"107\": 9313, \"194\": 1438, \"130\": 4718, \"131\": 4718, \"129\": 4718, \"105\": 9313, \"160\": 2879, \"125\": 5688, \"159\": 2879, \"154\": 3062, \"214\": 1425, \"175\": 1473, \"145\": 4616, \"167\": 2837, \"126\": 5646, \"225\": 1414, \"132\": 4688, \"133\": 4688, \"134\": 4688, \"108\": 9283, \"248\": 1391, \"127\": 5640, \"241\": 1402, \"181\": 1455, \"246\": 1398, \"110\": 7205, \"173\": 2662, \"262\": 887, \"220\": 1419, \"205\": 1430, \"204\": 1430, \"162\": 1430, \"197\": 1434, \"183\": 1448, \"209\": 1429, \"208\": 1429, \"177\": 1470, \"247\": 1392, \"193\": 1439, \"184\": 1445, \"142\": 4642, \"141\": 4642, \"140\": 4642, \"236\": 1409, \"143\": 4642, \"253\": 1383, \"195\": 1437, \"254\": 1382, \"202\": 1432, \"221\": 1419, \"178\": 1458, \"252\": 1390, \"222\": 1419, \"149\": 3762, \"188\": 1442, \"230\": 1412, \"169\": 2818, \"212\": 1426, \"213\": 1426, \"210\": 1427, \"161\": 2862, \"172\": 2793, \"242\": 1402, \"231\": 1412, \"232\": 1412, \"245\": 1400, \"249\": 1391, \"250\": 1391, \"168\": 2834, \"243\": 1401, \"206\": 1430, \"186\": 1445, \"185\": 1445, \"190\": 1441, \"189\": 1442, \"219\": 1420, \"199\": 1434, \"198\": 1434, \"234\": 1410, \"200\": 1434, \"240\": 1404, \"239\": 1404, \"260\": 902, \"179\": 1458, \"255\": 1378, \"256\": 1378, \"226\": 1413, \"261\": 892, \"259\": 908, \"258\": 908, \"191\": 1440, \"192\": 1440, \"223\": 1415, \"211\": 1427, \"263\": 86, \"264\": 7}", "index_word": "{\"1\": \"<UNK>\", \"2\": \"expr_variable\", \"3\": \"arg\", \"4\": \"stmt_expression\", \"5\": \"expr_assign\", \"6\": \"name\", \"7\": \"scalar_string\", \"8\": \"expr_funccall\", \"9\": \"var1\", \"10\": \"expr_constfetch\", \"11\": \"var2\", \"12\": \"var3\", \"13\": \"var4\", \"14\": \"expr_binaryop_concat\", \"15\": \"var5\", \"16\": \"var6\", \"17\": \"t\", \"18\": \"var7\", \"19\": \"input_get\", \"20\": \"arrayitem\", \"21\": \"expr_arraydimfetch\", \"22\": \"var8\", \"23\": \"expr_array\", \"24\": \"expr_methodcall\", \"25\": \"identifier\", \"26\": \"stmt_echo\", \"27\": \"true\", \"28\": \"password\", \"29\": \"print_r\", \"30\": \"var9\", \"31\": \"htmlentities\", \"32\": \"*\", \"33\": \"select\", \"34\": \"from\", \"35\": \"users\", \"36\": \"where\", \"37\": \"filter_input_array\", \"38\": \"stmt_if\", \"39\": \"filter_input\", \"40\": \"var10\", \"41\": \"stmt_while\", \"42\": \"var11\", \"43\": \"hello\", \"44\": \"expr_new\", \"45\": \"'\", \"46\": \"mydb\", \"47\": \"username\", \"48\": \"\\\"\", \"49\": \"to\", \"50\": \"expr_exit\", \"51\": \"mysql\", \"52\": \"mysqli\", \"53\": \"fetch_row\", \"54\": \"expr_binaryop_equal\", \"55\": \"printf\", \"56\": \"print\", \"57\": \"this:\", \"58\": \"vprintf\", \"59\": \"pin\", \"60\": \"=\", \"61\": \";\", \"62\": \"='\", \"63\": \"';\", \"64\": \"false\", \"65\": \"use_result\", \"66\": \"scalar_int\", \"67\": \"var12\", \"68\": \"filter_sanitize_special_chars\", \"69\": \"filter_sanitize_number_float\", \"70\": \"filter_unsafe_raw\", \"71\": \"filter_sanitize_number_int\", \"72\": \"filter_sanitize_url\", \"73\": \"filter_sanitize_email\", \"74\": \"filter_sanitize_add_slashes\", \"75\": \"=\\\"\", \"76\": \"\\\";\", \"77\": \"filter_sanitize_full_special_chars\", \"78\": \"<script>alert(\\\"hello\", \"79\": \"\\\");</script>\", \"80\": \"<script>alert(hello\", \"81\": \");</script>\", \"82\": \"<img\", \"83\": \"src=\\\"\", \"84\": \"\\\"/>\", \"85\": \"<a\", \"86\": \"href=\\\"\", \"87\": \"\\\">link</a>\", \"88\": \"%d\", \"89\": \"%s\", \"90\": \"filter_var\", \"91\": \"trigger_error\", \"92\": \"e_user_error\", \"93\": \"this%s\", \"94\": \"expr_print\", \"95\": \"user_error\", \"96\": \"this%d\", \"97\": \"database\", \"98\": \"uid\", \"99\": \"sa\", \"100\": \"pwd\", \"101\": \"msql12345678!\", \"102\": \"sqlsrv_connect\", \"103\": \"mssql\", \"104\": \"sqlsrv_errors\", \"105\": \"pdo\", \"106\": \"mysql:host=mysql;port=3306;dbname=mydb\", \"107\": \"stmt_foreach\", \"108\": \"query\", \"109\": \"apache_request_headers\", \"110\": \"getallheaders\", \"111\": \"implode\", \"112\": \"_\", \"113\": \"pg_pconnect\", \"114\": \"host=postgres-server\", \"115\": \"port=5432\", \"116\": \"user=postgres\", \"117\": \"password=postgres123\", \"118\": \"dbname=mydb\", \"119\": \"pg_fetch_row\", \"120\": \"database=mydb;hostname=ibm_db2;port=50000;protocol=tcpip;uid=db2inst1;pwd=ibm_db2_pw;\", \"121\": \"db2_connect\", \"122\": \"db2_stmt_errormsg\", \"123\": \"db2_fetch_array\", \"124\": \"settype\", \"125\": \"str_replace\", \"126\": \"htmlspecialchars\", \"127\": \"needle\", \"128\": \"gettype\", \"129\": \"prepare\", \"130\": \"execute\", \"131\": \"fetchall\", \"132\": \"sqlite3\", \"133\": \"/var/www/db/database.db\", \"134\": \"fetcharray\", \"135\": \"sqlsrv_query\", \"136\": \"sqlsrv_fetch_object\", \"137\": \"mysqli_prepare\", \"138\": \"mysqli_stmt_execute\", \"139\": \"mysqli_stmt_get_result\", \"140\": \"sqlsrv_prepare\", \"141\": \"sqlsrv_execute\", \"142\": \"sqlsrv_fetch_array\", \"143\": \"sqlsrv_fetch_assoc\", \"144\": \"multi_query\", \"145\": \"mysqli_real_query\", \"146\": \"mysqli_multi_query\", \"147\": \"real_query\", \"148\": \"preg_match\", \"149\": \"ent_compat\", \"150\": \"ent_noquotes\", \"151\": \"pg_send_query\", \"152\": \"pg_get_result\", \"153\": \"db2_exec\", \"154\": \"pg_query\", \"155\": \"db2_prepare\", \"156\": \"db2_execute\", \"157\": \"str_word_count\", \"158\": \"md5\", \"159\": \"<\", \"160\": \">\", \"161\": \"scalar_float\", \"162\": \"desc\", \"163\": \"substr_replace\", \"164\": \"bob\", \"165\": \"string\", \"166\": \"expr_binaryop_plus\", \"167\": \"ent_quotes\", \"168\": \"str_ireplace\", \"169\": \"fnmatch\", \"170\": \"sscanf\", \"171\": \"foo\", \"172\": \"expr_assignop_plus\", \"173\": \"json_encode\", \"174\": \"var13\", \"175\": \"is_string\", \"176\": \"ctype_cntrl\", \"177\": \"is_double\", \"178\": \"soundex\", \"179\": \"is_real\", \"180\": \"addslashes\", \"181\": \"ctype_digit\", \"182\": \"ctype_alpha\", \"183\": \"sha1\", \"184\": \"strtr\", \"185\": \"preg_replace\", \"186\": \"/'/\", \"187\": \"is_integer\", \"188\": \"is_bool\", \"189\": \"html_entity_decode\", \"190\": \"parse_str\", \"191\": \"password_hash\", \"192\": \"password_default\", \"193\": \"bool\", \"194\": \"intval\", \"195\": \"''\", \"196\": \"double\", \"197\": \"expr_cast_double\", \"198\": \"preg_match_all\", \"199\": \"/^[a-za-z0-9]*$/\", \"200\": \"count_chars\", \"201\": \"is_int\", \"202\": \"int\", \"203\": \"hexdec\", \"204\": \"expr_ternary\", \"205\": \"asc\", \"206\": \"boolean\", \"207\": \"rawurlencode\", \"208\": \"hash_hmac\", \"209\": \"salt\", \"210\": \"urlencode\", \"211\": \"strripos\", \"212\": \"addcslashes\", \"213\": \";:'\\\"\", \"214\": \"ctype_alnum\", \"215\": \"crypt\", \"216\": \"gzdeflate\", \"217\": \"strspn\", \"218\": \"needle)\", \"219\": \"substr_count\", \"220\": \"metaphone\", \"221\": \"is_float\", \"222\": \"expr_cast_string\", \"223\": \"crc32\", \"224\": \"str_getcsv\", \"225\": \"ord\", \"226\": \"is_numeric\", \"227\": \"safe1\", \"228\": \"safe2\", \"229\": \"in_array\", \"230\": \"whitelisting\", \"231\": \"zlib_encode\", \"232\": \"zlib_encoding_deflate\", \"233\": \"/^[0-9]*$/\", \"234\": \"is_long\", \"235\": \"base64_encode\", \"236\": \"ctype_xdigit\", \"237\": \"bin2hex\", \"238\": \"float\", \"239\": \"mhash\", \"240\": \"mhash_md4\", \"241\": \"strpos\", \"242\": \"doubleval\", \"243\": \"floatval\", \"244\": \"gzcompress\", \"245\": \"expr_cast_int\", \"246\": \"strip_tags\", \"247\": \"gzencode\", \"248\": \"strrpos\", \"249\": \"hash\", \"250\": \"ripemd160\", \"251\": \"/^[a-za-z]*$/\", \"252\": \"bindec\", \"253\": \"/[0-9]/\", \"254\": \"str_shuffle\", \"255\": \"strstr\", \"256\": \"1\", \"257\": \"integer\", \"258\": \"sizeof\", \"259\": \"count_normal\", \"260\": \"count\", \"261\": \"http_build_query\", \"262\": \"json_pretty_print\", \"263\": \"quote\", \"264\": \"var14\"}", "word_index": "{\"<UNK>\": 1, \"expr_variable\": 2, \"arg\": 3, \"stmt_expression\": 4, \"expr_assign\": 5, \"name\": 6, \"scalar_string\": 7, \"expr_funccall\": 8, \"var1\": 9, \"expr_constfetch\": 10, \"var2\": 11, \"var3\": 12, \"var4\": 13, \"expr_binaryop_concat\": 14, \"var5\": 15, \"var6\": 16, \"t\": 17, \"var7\": 18, \"input_get\": 19, \"arrayitem\": 20, \"expr_arraydimfetch\": 21, \"var8\": 22, \"expr_array\": 23, \"expr_methodcall\": 24, \"identifier\": 25, \"stmt_echo\": 26, \"true\": 27, \"password\": 28, \"print_r\": 29, \"var9\": 30, \"htmlentities\": 31, \"*\": 32, \"select\": 33, \"from\": 34, \"users\": 35, \"where\": 36, \"filter_input_array\": 37, \"stmt_if\": 38, \"filter_input\": 39, \"var10\": 40, \"stmt_while\": 41, \"var11\": 42, \"hello\": 43, \"expr_new\": 44, \"'\": 45, \"mydb\": 46, \"username\": 47, \"\\\"\": 48, \"to\": 49, \"expr_exit\": 50, \"mysql\": 51, \"mysqli\": 52, \"fetch_row\": 53, \"expr_binaryop_equal\": 54, \"printf\": 55, \"print\": 56, \"this:\": 57, \"vprintf\": 58, \"pin\": 59, \"=\": 60, \";\": 61, \"='\": 62, \"';\": 63, \"false\": 64, \"use_result\": 65, \"scalar_int\": 66, \"var12\": 67, \"filter_sanitize_special_chars\": 68, \"filter_sanitize_number_float\": 69, \"filter_unsafe_raw\": 70, \"filter_sanitize_number_int\": 71, \"filter_sanitize_url\": 72, \"filter_sanitize_email\": 73, \"filter_sanitize_add_slashes\": 74, \"=\\\"\": 75, \"\\\";\": 76, \"filter_sanitize_full_special_chars\": 77, \"<script>alert(\\\"hello\": 78, \"\\\");</script>\": 79, \"<script>alert(hello\": 80, \");</script>\": 81, \"<img\": 82, \"src=\\\"\": 83, \"\\\"/>\": 84, \"<a\": 85, \"href=\\\"\": 86, \"\\\">link</a>\": 87, \"%d\": 88, \"%s\": 89, \"filter_var\": 90, \"trigger_error\": 91, \"e_user_error\": 92, \"this%s\": 93, \"expr_print\": 94, \"user_error\": 95, \"this%d\": 96, \"database\": 97, \"uid\": 98, \"sa\": 99, \"pwd\": 100, \"msql12345678!\": 101, \"sqlsrv_connect\": 102, \"mssql\": 103, \"sqlsrv_errors\": 104, \"pdo\": 105, \"mysql:host=mysql;port=3306;dbname=mydb\": 106, \"stmt_foreach\": 107, \"query\": 108, \"apache_request_headers\": 109, \"getallheaders\": 110, \"implode\": 111, \"_\": 112, \"pg_pconnect\": 113, \"host=postgres-server\": 114, \"port=5432\": 115, \"user=postgres\": 116, \"password=postgres123\": 117, \"dbname=mydb\": 118, \"pg_fetch_row\": 119, \"database=mydb;hostname=ibm_db2;port=50000;protocol=tcpip;uid=db2inst1;pwd=ibm_db2_pw;\": 120, \"db2_connect\": 121, \"db2_stmt_errormsg\": 122, \"db2_fetch_array\": 123, \"settype\": 124, \"str_replace\": 125, \"htmlspecialchars\": 126, \"needle\": 127, \"gettype\": 128, \"prepare\": 129, \"execute\": 130, \"fetchall\": 131, \"sqlite3\": 132, \"/var/www/db/database.db\": 133, \"fetcharray\": 134, \"sqlsrv_query\": 135, \"sqlsrv_fetch_object\": 136, \"mysqli_prepare\": 137, \"mysqli_stmt_execute\": 138, \"mysqli_stmt_get_result\": 139, \"sqlsrv_prepare\": 140, \"sqlsrv_execute\": 141, \"sqlsrv_fetch_array\": 142, \"sqlsrv_fetch_assoc\": 143, \"multi_query\": 144, \"mysqli_real_query\": 145, \"mysqli_multi_query\": 146, \"real_query\": 147, \"preg_match\": 148, \"ent_compat\": 149, \"ent_noquotes\": 150, \"pg_send_query\": 151, \"pg_get_result\": 152, \"db2_exec\": 153, \"pg_query\": 154, \"db2_prepare\": 155, \"db2_execute\": 156, \"str_word_count\": 157, \"md5\": 158, \"<\": 159, \">\": 160, \"scalar_float\": 161, \"desc\": 162, \"substr_replace\": 163, \"bob\": 164, \"string\": 165, \"expr_binaryop_plus\": 166, \"ent_quotes\": 167, \"str_ireplace\": 168, \"fnmatch\": 169, \"sscanf\": 170, \"foo\": 171, \"expr_assignop_plus\": 172, \"json_encode\": 173, \"var13\": 174, \"is_string\": 175, \"ctype_cntrl\": 176, \"is_double\": 177, \"soundex\": 178, \"is_real\": 179, \"addslashes\": 180, \"ctype_digit\": 181, \"ctype_alpha\": 182, \"sha1\": 183, \"strtr\": 184, \"preg_replace\": 185, \"/'/\": 186, \"is_integer\": 187, \"is_bool\": 188, \"html_entity_decode\": 189, \"parse_str\": 190, \"password_hash\": 191, \"password_default\": 192, \"bool\": 193, \"intval\": 194, \"''\": 195, \"double\": 196, \"expr_cast_double\": 197, \"preg_match_all\": 198, \"/^[a-za-z0-9]*$/\": 199, \"count_chars\": 200, \"is_int\": 201, \"int\": 202, \"hexdec\": 203, \"expr_ternary\": 204, \"asc\": 205, \"boolean\": 206, \"rawurlencode\": 207, \"hash_hmac\": 208, \"salt\": 209, \"urlencode\": 210, \"strripos\": 211, \"addcslashes\": 212, \";:'\\\"\": 213, \"ctype_alnum\": 214, \"crypt\": 215, \"gzdeflate\": 216, \"strspn\": 217, \"needle)\": 218, \"substr_count\": 219, \"metaphone\": 220, \"is_float\": 221, \"expr_cast_string\": 222, \"crc32\": 223, \"str_getcsv\": 224, \"ord\": 225, \"is_numeric\": 226, \"safe1\": 227, \"safe2\": 228, \"in_array\": 229, \"whitelisting\": 230, \"zlib_encode\": 231, \"zlib_encoding_deflate\": 232, \"/^[0-9]*$/\": 233, \"is_long\": 234, \"base64_encode\": 235, \"ctype_xdigit\": 236, \"bin2hex\": 237, \"float\": 238, \"mhash\": 239, \"mhash_md4\": 240, \"strpos\": 241, \"doubleval\": 242, \"floatval\": 243, \"gzcompress\": 244, \"expr_cast_int\": 245, \"strip_tags\": 246, \"gzencode\": 247, \"strrpos\": 248, \"hash\": 249, \"ripemd160\": 250, \"/^[a-za-z]*$/\": 251, \"bindec\": 252, \"/[0-9]/\": 253, \"str_shuffle\": 254, \"strstr\": 255, \"1\": 256, \"integer\": 257, \"sizeof\": 258, \"count_normal\": 259, \"count\": 260, \"http_build_query\": 261, \"json_pretty_print\": 262, \"quote\": 263, \"var14\": 264}"}}